china-djyos/djyos/bsp/chipdrv/ksz8081rnb/imxrt1052-evk/ksz8081.c
//----------------------------------------------------
// Copyright (c) 2018, Djyos Open source Development team. All rights reserved.

// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2018，著作权由都江堰操作系统开源开发团队所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------

// 文件名     ：ksz8081.c
// 模块描述: PHY芯片KSZ8081RNB在RT1052平台下的驱动
// 模块版本: V1.00
// 创建人员: chj
// 创建时间: 05/15.2018
// =============================================================================
#include "ksz8081.h"
#include "fsl_phy.h"
#include "fsl_clock.h"
#include "board.h"
#include "board-config.h"
#include "cpu_peri_eth.h"
#include "project_config.h"     //本文件由IDE中配置界面生成，存放在APP的工程目录中。
                                //允许是个空文件，所有配置将按默认值配置。

//@#$%component configure   ****组件配置开始，用于 DIDE 中图形化配置界面
//****配置块的语法和使用方法，参见源码根目录下的文件：component_config_readme.txt****
//%$#@initcode      ****初始化代码开始，由 DIDE 删除“//”后copy到初始化文件中
//    #include "fsl_enet.h"
//    extern bool_t ksz8081_init(tagPhyMessage* phy);
//    tagPhyMessage phy;
//    phy.speed = CFG_KSZ8081_PHY_SPEED;
//    phy.duplex = CFG_KSZ8081_PHY_DUPLEX;
//    if(false == ksz8081_init (&phy))
//    {
//        printf("ksz8081_init failed!\r\n);
//        while(1);
//    }
//%$#@end initcode  ****初始化代码结束

//%$#@describe      ****组件描述开始
//component name:"ksz8081"         //以太网phy驱动
//parent:"none"                 //填写该组件的父组件名字，none表示没有父组件
//attribute:bsp                 //选填“third、system、bsp、user”，本属性用于在IDE中分组
//select:choosable              //选填“required、choosable、none”，若填必选且需要配置参数，则IDE裁剪界面中默认勾取，
                                //不可取消，必选且不需要配置参数的，或是不可选的，IDE裁剪界面中不显示，
//init time:medium              //初始化时机，可选值：early，medium，later。
                                //表示初始化时间，分别是早期、中期、后期
//dependence:"fsl_phy"             //该组件的依赖组件名（可以是none，表示无依赖组件），
                                //选中该组件时，被依赖组件将强制选中，
                                //如果依赖多个组件，则依次列出，用“,”分隔
//weakdependence:"none"         //该组件的弱依赖组件名（可以是none，表示无依赖组件），
                                //选中该组件时，被依赖组件不会被强制选中，
                                //如果依赖多个组件，则依次列出，用“,”分隔
//mutex:"none"                  //该组件的依赖组件名（可以是none，表示无依赖组件），
                                //如果依赖多个组件，则依次列出，用“,”分隔
//%$#@end describe  ****组件描述结束

//%$#@configue      ****参数配置开始
//%$#@target = header           //header = 生成头文件,cmdline = 命令行变量，DJYOS自有模块禁用
#ifndef CFG_KSZ8081_PHY_SPEED   //****检查参数是否已经配置好
#warning    ksz8081组件参数未配置，使用默认值
//%$#@num,0,100,
//%$#@enum,0,1
#define CFG_KSZ8081_PHY_SPEED           1//"speed",1 = 100M，0 = 10M
#define CFG_KSZ8081_PHY_DUPLEX          1//"duplex",1 = full duplex, 0 = half duplex
//%$#@string,1,10
//%$#select,        ***定义无值的宏，仅用于第三方组件
//%$#@free,
#endif
//%$#@end configue  ****参数配置结束
//@#$%component end configure


#define CORE_CLK_FREQ CLOCK_GetFreq(kCLOCK_AhbClk)
#define WTICH_ENET          ENET
#define PHY_CLK             (50*Mhz)
bool_t ksz8081_init(tagPhyMessage* phy)
{
    bool link=false;
    status_t status;
    phy_speed_t speed;
    phy_duplex_t duplex;

    EthOutClkToPhy(WTICH_ENET,PHY_CLK);
    status = PHY_Init(WTICH_ENET, KSZ8081_PHY_ADDR, CORE_CLK_FREQ);
    if (status != kStatus_Success)
    {
        return false;
    }
    PHY_GetLinkStatus(WTICH_ENET, KSZ8081_PHY_ADDR, &link);
    if (link)
    {
        /* Get the actual PHY link speed. */
        PHY_GetLinkSpeedDuplex(WTICH_ENET, KSZ8081_PHY_ADDR, &speed, &duplex);
        /* Change the MII speed and duplex for actual link status. */
        phy->speed = ((enet_mii_speed_t)speed==kENET_MiiSpeed100M?\
                                        CPU_ETH_SPEED_100M:CPU_ETH_SPEED_10M);
        phy->duplex = ((enet_mii_duplex_t)duplex==kENET_MiiFullDuplex?\
                                        CPU_ETH_FULL_DUPLEX:CPU_ETH_HALF_DUPLEX);
        return true;
    }
    return false;
}
